/*
Да се напише програма која за дадена сума на пари, ќе испечати со колку најмалку банкноти и монети може да се исплати. На влез се чита еден цел број. На излез се печатат 9 редови, по колку банкноти или монети од секој апоен ни се потребни за да ја исплатиме сумата. Пример 1583 денари, најдобро е да се исплати како:

0*5000

1*1000

1*500

0*100

1*50

3*10

0*5

1*2

1*1
*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
        int s;
        scanf("%d", &s);
        printf("%d*5000\n", s/5000);
        s%=5000;
        printf("%d*1000\n", s/1000);
        s%=1000;
        printf("%d*500\n", s/500);
        s%=500;
        printf("%d*100\n", s/100);
        s%=100;
        printf("%d*50\n", s/50);
        s%=50;
        printf("%d*10\n", s/10);
        s%=10;
        printf("%d*5\n", s/5);
        s%=5;
        printf("%d*2\n", s/2);
        s%=2;
        printf("%d*1\n", s/1);
        s%=1;
    return 0;
}
