/*
Даден е правоаголник кој се наоѓа во првиот квадрант од координатниот систем и страните му се паралелни со оските. Правоаголникот се задава со координатите на долното лево и горното десно теме (темињата А и С) кои се цели броеви. Потоа, се внесуваат координатите на две точки. Вашата програма за секоја од двете точки на излез треба да отпечати DA, ако дадената точка лежи врз правоаголникот (во правоаголникот и на страните) и NE ако е надвор од него.
*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int x1, y1;
    int x2, y2;
    scanf("%d %d", &x1, &y1);//tochka 1 (dole levo)
    scanf("%d %d", &x2, &y2);//tochka 2 (gore desno)
    int x3, y3;
    int x4, y4;
    scanf("%d %d", &x3, &y3);//tochka 3
    scanf("%d %d", &x4, &y4);//tochka 4
//  KRAJ NA INPUT
    if((x3>=x1&&x3<=x2)&&(y3>=y1&&y3<=y2)){
     printf("DA\n");
    }else printf("NE\n");

    if((x4>=x1&&x4<=x2)&&(y4>=y1&&y4<=y2)){
     printf("DA\n");
    }else printf("NE\n");

    return 0;
}
