/*
Од населбата каде што живее Мила до факултетот има само две автобуски линии. Едната автобуска линија застанува на P постојки по времетраење од М минути и се движи со К километри во минута, притоа во просек измеѓу секоја постојка на семафор чека С минути. Додека другата се движи по различна рута и застанува на D постојки, на секоја постојка чека Z минути, се движи со V километри во минута и измеѓу секоја постојка чека на семафор R минути. Ваша задача е за даден број на километри до дестинацијата да пресметате со кој автобус побрзо ќе стигне Мила до факултетот.

Влез: Во првата линија е даден бројот на километри до дестинацијата. Во наредната линија се дадени P,M, K, C. Во третата линија се дадени D, Z, V, R.

Излез: Во првиот ред се печати времетраењето на возењето до факултетот во минути со првиот и вториот автобус со празно место. А во втората линија се печати 1 ако првиот автобус побрзо стигнува до факултетот, 0 ако побавно стигнува до факултетот.

Пример: За влезот
10
12 2 0.5 3
9 4 0.6 2
Се добива дека првиот автобус ќе стигни за: 12*2 + (12-1)*3 + 10/0.5 = 77 минути
Вториот автобус ќе стигни за: 9*4 + (9-1)*2 + 10/0.6 = 68 минути
*/

#include <stdio.h>
#include <stdlib.h>
int main() {
    int p,m,c;
    int d,z,r;
    int len;
    float k;
    float v;
    scanf("%d %d %d %f %d %d %d %f %d", &len, &p, &m, &k, &c, &d, &z, &v, &r);
    int f1=(p*m) + (p-1)*c + (len/k);
    int f2=(d*z) + (d-1)*r + (len/v);
    printf("%d %d\n%d", f1, f2, f2>f1);
    return 0;
}
