/*
Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8). Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура), да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.
*/

#include <stdio.h>
#include <stdlib.h>
/*Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8).
Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура),
да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.

For example:
Input 	Result

99 500
200
*/
int main()
{
    int i;
    int m, n;
    scanf("%d %d", &m, &n);
    for(i=m; i<=n; i++){
        int temp=i;
        while (temp!=0){
            if ((temp%10)%2==0){
                    temp/=10;
            } else break;
        }
        if (temp==0){
            printf("%d", i);
            return 0;
        }
    }
    printf("NE");
    return 0;
}
