/*
Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), а потоа се внесува и цел број ind (ind >= 0).

Да се напише функција sum_pos која ја прима низата, бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата. Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind па се до крајот на низата. Ако индексот ind е поголем од Nфункцијата треба да врати 0.

НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).

Пример

влез:

10
2 4 6 8 1 3 9 12 33 44
6

излез:

98

98 = 9+12+33+44
*/

#include <stdio.h>
#include <stdlib.h>

int sum_pos(int *arr, int n, int ind){
    int i;
    int sum=0;
    if(ind>n) return 0;
    else
        for(i=ind; i<n; i++){
            sum+=*(arr+i);
        }
        return sum;
}

int main() {
    int a[100], n, ind, i;
    scanf("%d", &n);
    for (i = 0; i < n; i++){
        scanf("%d", &*(a+i));
    }
    scanf("%d", &ind);
    printf("%d", sum_pos(a,n, ind));
    return 0;
}
