/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.
*/

#include <stdio.h>

int main() {
    int n,m;
    int i,j;
    int a[100][100];
    int ind1,ind2;
    int sumq1=0,sumq2=0,sumq3=0,sumq4=0;
    scanf("%d %d", &n, &m);
    for (i=0; i<n; i++){
        for (j=0; j<m; j++){
            scanf("%d", &a[i][j]);
        }
    }
    scanf("%d %d", &ind1, &ind2);
    for (i=0; i<ind1; i++){
        for (j=ind2; j<m; j++){
            sumq1+=a[i][j];
        }
    }
    for (i=0; i<ind1; i++){
        for (j=0; j<ind2; j++){
            sumq2+=a[i][j];
        }
    }
    for (i=ind1; i<n; i++){
        for (j=0; j<ind2; j++){
            sumq3+=a[i][j];
        }
    }
    for (i=ind1; i<n; i++){
        for (j=ind2; j<m; j++){
            sumq4+=a[i][j];
        }
    }
    printf("%d %d %d %d", sumq1, sumq2, sumq3, sumq4);
}
