/*
Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), а потоа се внесува и цел број ind (ind >= 0).

Да се напише функција sum_pos која ја прима низата, бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата. Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind па се до крајот на низата. Ако индексот ind е поголем од Nфункцијата треба да врати 0.

НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).

Пример

влез:

10
2 4 6 8 1 3 9 12 33 44
6

излез:

98

98 = 9+12+33+44
*/

#include <stdio.h>

int sum_pos(int *arr, int inx, int n) {
  int sum = 0;
  for (int i = inx; i < n; i++) {
    if (arr[i] > 0) {
      sum += arr[i];
    }
  }
  return sum;
}

int main() {
  int n, inx;
  int arr[100];

  scanf("%d", &n);

  for (int i = 0; i < n; i++) {
    scanf("%d", &arr[i]);
  }

  scanf("%d", &inx);

  int sum = sum_pos(arr, inx, n);

  if (sum == 0) {
    printf("0");
  } else {
    printf("%d", sum);
  }

  return 0;
}
