/*
Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:

    индекс (шестцифрен цел број)
    шест оценки од последниот семестар кој го слушал

Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот: (погледнете во тест примерите за форматот на печатење)

    просек на студентот
        просекот да се испечати со точност од 3 децимали
    година на студии
        студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.
    дали е награден (1 = награден, 0 = не е награден)
        Еден студент се наградува доколку има просек еднаков или поголем од 9.5

*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int indeks;
    float o1, o2, o3, o4, o5, o6;
    float prosek;
    scanf("%d", &indeks);
    scanf("%f %f %f %f %f %f", &o1, &o2, &o3, &o4, &o5, &o6);
    prosek=(o1+o2+o3+o4+o5+o6)/6;
    printf("Prosek: %.3f\n", prosek);
    printf("Student: %d\n", indeks);
    printf("%d godina\n", 23-(indeks/10000));
    printf("Nagraden: %d", prosek>=9.5);
    return 0;
}
