/*
Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви, која се чита во продолжение. Да се напише програма која за таа матрица(макс. 100 x 100) ќе ја испечати должината на најдолгата строго растечка подниза, доколку матрицата ја гледаме ред по ред.

На пример, ако е дадена следната матрица:

1 2 3 9 8
5 5 5 5 5 
0 1 2 0 0 
9 1 2 3 4 
1 1 1 1 1

должината на најдолгата строго растечка подниза е 4, а тоа е должината на поднизата 1 2 3 4, во четвртиот ред.
*/

#include <stdio.h>
#include <stdlib.h>
int main(){
    int n, i, j;
    int a[100]={0};
    int k=0;
    
    scanf("%d", &n);

    int tempmax=0;
    int max=0;

for (i=0; i<n; i++){
    k=0; //resetiraj k
    
    for (j=0; j<n; j++){
        scanf("%d", &a[j]);
    }
                           
    for (j=0; j<=n; j++){

            if (a[j+1]>a[j]){
                k++;
                tempmax=k;
                }
            }
            
            if (max<tempmax){
                max=tempmax;
            }
                            //proverka za maksimalno k od site i nizi
}
        max+=1;
        printf("%d", max);
        
    return 0;
}
